Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: སྔོན་གྱི་ཚེ་རབས་གཞན་རྣམས་སུ། །བདག་ནི་ལྷམ་མཁན་གྱུར་པ་ན།
en: “Once when I was A shoemaker in another life,

source: །མུ་གེ་བྱུང་ནས་དེ་ནས་བདག །ཀོ་བའི་རས་མ་རྣམས་འཚེད་དོ། །བཟའ་བར་བྱ་བ་ཁོ་ནའི་ཕྱིར། །ཀོ་བའི་རས་མ་འཚེད་པ་ལས། །དགེ་སྦྱོང་གཞན་ཞིག་ཟས་ཀྱི་ཕྱིར།
en: A famine broke out And I cooked a piece of hide. “When I was cooking the piece of hide In order to eat it,

source: །བསོད་སྙོམས་ལ་ནི་བྱོན་པ་དང་། །དེ་ལ་བདག་གིས་སེམས་དད་པས།
en: A śramaṇa approached me For alms. “With my mind filled with faith in him,

source: །ཀོ་རས་ཀྱི་ནི་ཐུག་པ་བྱིན།
en: I gave him the stewed piece of hide.

source: །དགེ་སྦྱོང་དེས་ནི་ལོངས་སྤྱད་ནས།
en: Having had it,

source: །དེ་ནས་ནམ་མཁར་འཕགས་པར་གྱུར།
en: The śramaṇa soared up into the air.

source: །བདག་ནི་རབ་ཏུ་དགའ་གྱུར་ནས།
en: “I acquired faith

source: །ཐལ་མོ་ལེགས་པར་སྦྱར་བྱས་ཏེ།
en: And respectfully made the gesture of supplication.

source: །དེ་ནས་གང་དང་གང་དུ་ནི།
en: Then I followed him

source: །སོང་བ་ཀུན་དུ་འབྲེང་བྱས་སོ།
en: Wherever he went.

source: །དགའ་བ་རྒྱ་ཆེན་ཐོབ་ནས་ཀྱང་།
en: “Having found great pleasure,

source: །གནས་བརྟན་འདི་ལྟ་བུ་དང་བདག །ལྷན་ཅིག་འདུག་པར་གྱུར་པར་ཤོག །དགེ་སློང་འདི་ཡི་ལས་ཀྱིས་ནི།
en: ‘May I always be together with An elder like him! “ ‘May I attain

source: །དྲི་མེད་ཆོས་ནི་གང་རེག་པ།
en: The taintless nature

source: །བདག་གིས་ཆོས་དེ་རིག་གྱུར་ཅེས།
en: That this monk has attained with his body!’

source: །དེ་ཚེ་སྨོན་ལམ་བཏབ་པར་གྱུར།
en: Thus I made such an aspiration. “I then offered a donation of food,

source: །ཁ་དོག་ལྡན་པ་མ་ཡིན་ཞིང་།
en: Which was poor looking,

source: །དྲི་ནི་སྨད་པར་གྱུར་པ་དང་། །རོ་དང་ལྡན་པ་མ་ཡིན་པའི། །སྦྱིན་པ་བདག་གིས་དེ་ཚེ་བཏང་།
en: Ill smelling, And bad tasting.

source: །དགེ་བ་ཆུང་ངུ་བྱས་པས་ཀྱང་།
en: “By doing a little good like that,

source: །བདེ་བ་མང་པོ་མྱོང་བར་གྱུར།
en: I experienced much happiness.

source: །བདག་ནི་སྐྱེ་བ་ཐ་མ་ནི།
en: “My final birth is

source: །མིའི་སྲིད་ཐོབ་པ་འདི་ཡིན་ཏེ།
en: This human life I have attained. I have pleased this caravan leader,

source: །བདག་གིས་སྨོན་ལམ་གང་བཏབ་པའི། །བྱང་ཆུབ་དམ་པ་འདི་རེག་སྟེ།
en: For which I made an aspiration.

source: །བདག་གིས་ད་ལྟར་བསིལ་གྱུར་པའི།
en: I have now fully attained

source: །མྱ་ངན་འདས་པ་ལེགས་པར་ཐོབ།
en: Peaceful nirvāṇa.”

source: །དེ་ནས་གནས་བརྟན་ཆེན་པོ་ནི།
en: Thus the great elder called Sthavira,

source: །གནས་བརྟན་ཞེས་བྱ་མཐུ་ཆེན་གྱིས།
en: Who possessed great power,

source: །གནས་བརྟན་གནས་བརྟན་ཞེས་བྱ་བའི་ལེའུ་སྟེ་བཅུ་བཞི་པའོ།། །།
en: Here ends the fourteenth section: The Section of the Elder named Sthavira. 5. The Three

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་ལ་སོགས་པ་གནས་བརྟན་གསུམ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested three elders among them, including the venerable Uruvilvā-Kāśyapa, “O Venerables, the elder called Sthavira has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་དག་གནས་བརྟན་གནས་བརྟན་ཞེས་བྱ་བས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, venerables, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་དག་གིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་དེ་རྣམས་ཀྱིས་ཀྱང་ལུང་བསྟན་པར་བརྩམས་པ།
en: Then they also explained their karmic bonds:

source: བདག་ཅག་གསུམ་ནི་སྤུན་གྱུར་ནས། །ལྷན་ཅིག་ཚོང་དཔོན་གྱུར་པ་ན།
en: “When we three were brothers And all merchants,

source: །འོད་སྲུང་མཆོད་རྟེན་རལ་པ་དང་། །ཤག་ཤིག་འདུག་པ་མཐོང་གྱུར་ནས།
en: We saw Kāśyapa’s stūpa Broken into pieces.

source: །ཚོང་པ་ཐམས་ཅད་བསྡུས་ནས་ནི།
en: “We called together all the merchants

source: །དེས་ནི་སླར་ཡང་སར་པ་བརྩིགས།
en: And rebuilt it anew.

source: །སྤུན་རྣམས་དག་ནི་ལྷན་ཅིག་ཏུ།
en: We brothers together

source: །གདུགས་གསུམ་ཞིག་ནི་གདགས་པ་བྱས།
en: Had three parasols set there.

source: །མཐོ་རིས་གནས་སུ་ཡུན་རིང་དགའ།
en: We enjoyed dwelling in heaven for a long time.

source: །མི་རྣམས་སུ་ནི་སླར་འོངས་ནས།
en: When we returned to human life,

source: །ཕྱུག་པོའི་རིགས་ཆེན་དག་ཏུ་སྐྱེས།
en: We were born into a wealthy family.

source: །རྫོགས་པའི་སངས་རྒྱས་མ་མཐོང་ནས།
en: “Not having seen the Completely Awakened One,

source: །མུ་སྟེགས་གཞན་ལས་རབ་ཏུ་བྱུང་། །ནཻ་རཉྫ་ནའི་ཆུ་ངོགས་སུ།
en: We went forth in a different faith.

source: །ཆོ་འཕྲུལ་མཛད་པ་མཐོང་ནས་ནི།
en: When we saw the one performing miracles On the bank of the Nairañjanā,

source: །དེ་ནས་དེ་ལ་རབ་འབྱུང་ཕྱིར། །བདག་ཅག་གིས་ཀྱང་གསོལ་བ་བཏབ།
en: “We then begged him for permission To go forth in his presence.

source: །དེ་ནས་ཐུགས་རྗེ་ཅན་གྱི་ནི།
en: Then, out of compassion,

source: །ཐུགས་བརྩེས་བདག་ཅག་རབ་ཏུ་ཕྱུང་།
en: The merciful one let us go forth.

source: །བདག་ཅག་ག་ཡཱ་མགོར་སོན་ནས།
en: “We went to Gayāśīrṣa

source: །གཽ་ཏ་མའི་བསྟན་པ་ཐོས།
en: And heard Gautama’s teachings.

source: །དེ་ནས་བརྩོན་འགྲུས་བརྩམས་པས་ནི།
en: Thereupon, having exerted ourselves,

source: །མྱ་ངན་འདས་པ་དམ་པ་ཐོབ།
en: We attained the supreme nirvāṇa.

source: །ད་ལྟར་སྟོན་པ་བཀུར་བྱས་ཤིང་།
en: “Since at that time, serving the Teacher,

source: །དེ་ཚེ་མཆོད་རྟེན་མངོན་བཏུད་པས།
en: We respectfully saluted the stūpa,

source: །བདག་ཅག་ཀུན་ནི་རབ་བྱུང་ནས།
en: We all went forth

source: །བསིལ་བར་གྱུར་ཏེ་མྱ་ངན་འདས།
en: And became peaceful and emancipated.”

source: །ལྟེང་རྒྱས་དང་ནི་ཆུ་ཀླུང་དང་། །ག་ཡཱ་འོད་སྲུང་གནས་བརྟན་གསུམ།
en: “The three elders, Uruvilvā-, Nadī-,

source: །མ་དྲོས་པ་ཡི་མཚོ་ཆེན་དུ།
en: And Gayā-Kāśyapa,

source: །རང་གི་ལས་ནི་ལུང་བསྟན་ཏོ།
en: Explained their karma

source: །ལྟེང་རྒྱས་དང་། ཆུ་ཀླུང་དང་། ག་ཡཱ་འོད་སྲུང་རྣམས་ཀྱི་ལེའུ་སྟེ་བཅོ་ལྔ་པའོ།། །།
en: At the great lake Anavatapta. Here ends the fifteenth section: The Section of Uruvilvā-, Nadī-, and Gayā-Kāśyapa. 6. Yaśas (2)

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་གྲགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གྲགས་པ་ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་དང་། ཆུ་ཀླུང་དང་། །ག་ཡཱ་འོད་སྲུང་རྣམས་ཀྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Yaśas, “O Venerable Yaśas, the venerables Uruvilvā-, Nadī-, and Gayā-Kāśyapa have explained their karmic bonds.

source: ཚེ་དང་ལྡན་པ་གྲགས་པས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་གྲགས་པས་ཀྱང་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Now you should also explain your karmic bond.” Then the venerable Yaśas did explain his karmic bond:

source: བདག་སྔོན་དྲི་འཚོང་གྱུར་པ་ན།
en: “Once when I was a perfumer,

source: །དྲི་རྣམས་འཚོང་ལ་མཁས་གྱུར་པས།
en: I was skillful in selling perfumes. Women and girls came to me

source: །དེར་ནི་དེ་ཚེ་ཉོ་བའི་ཕྱིར། །བུད་མེད་གཞོན་ནུ་མ་དག་འོངས།
en: To buy them at that time.

source: །དེར་ནི་བདག་གིས་གཟུགས་ལྡན་མའི།
en: “There I saw

source: །བུད་མེད་འོངས་པ་མཐོང་ནས་ནི།
en: A beautiful woman approaching.

source: །འདྲེན་བརྐྱང་གིས་ནི་ཚིག་སྨྲས་ཤིང་།
en: Speaking attractive words,

source: །ཆགས་པའི་སེམས་ཀྱིས་རེག་པར་བྱས།
en: I touched her with thoughts of desire.

source: །འདུ་ཞིང་ལྷན་ཅིག་འཁོད་པའམ།
en: “Although I did not sit with her

source: །མི་ཚངས་སྤྱོད་པ་སྤྲོ་མེད་ཀྱང་།
en: Or commit unchastity,

source: །མ་བརྟགས་གཞན་གྱི་བུད་མེད་ལ།
en: I let my hand touch another’s wife

source: །ལག་པས་རེག་པར་བྱས་པས་ན།
en: Without self-restraint.

source: །སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེས།
en: I was born in the hells.

source: །སླར་ཡང་མིར་ནི་འོངས་པ་ན།
en: When I returned again to human life,

source: །ལག་པ་གཡས་པ་བསྐམས་པར་གྱུར།
en: My right hand was withered.

source: །རྟག་ཏུ་བདག་གི་ལག་པ་ནི། །གཡས་པ་ཞ་ཞིང་རྣམ་པར་བསྐམས།
en: My right hand was Always impaired and withered.

source: །བདག་གིས་སངས་རྒྱས་མཉེས་བྱས་ནས།
en: “Having pleased the Buddha,

source: །མྱ་ངན་འདས་པའི་བདེར་གྱུར་པའི། །དགྲ་བཅོམ་པ་ཡང་བདག་གིས་ཐོབ།
en: I attained nirvāṇa, The happy state of an arhat.

source: །བཙུན་པ་བདག་གིས་མི་དགེ་བ།
en: “O honored ones, this is the nonvirtuous deed

source: །གང་བགྱིས་དྲན་པ་འདི་ལགས་ཏེ། །ལས་རྣམས་ཆུད་མི་ཟ་བས་ན།
en: That I remember performing.

source: །ད་དུང་དུ་ཡང་བཙུན་པ་དག །བདག་ནི་རྫུ་འཕྲུལ་ལྡན་གྱུར་ནའང་།
en: “Even though now, O honored ones, I am endowed with magical power,

source: །ལག་པ་གཡས་འདི་ཇི་ལྟ་བར།
en: This right hand

source: །གཡོན་པ་དེ་ལྟ་མ་ལགས་སོ།
en: Is not like the left one.

source: །སྐྱེས་པའམ་བུད་མེད་གང་ཡང་རུང་།
en: “A man or woman

source: །བྱི་བོ་བྱེད་པ་གང་ཡིན་པ།
en: Who commits adultery Tastes the sensation of despair

source: །སེམས་ཅན་དམྱལ་བར་སྐྱེས་ནས་ནི། །དེ་ནི་སྡུག་བསྔལ་ཚོར་བ་མྱོང་།
en: After being reborn in hell.

source: །མཁས་པ་བློ་དང་ལྡན་པའི་མིས། །རབ་འབར་མེ་ནི་ཇི་ལྟ་བར།
en: “One who is wise and intelligent

source: །གཞན་གྱི་བུད་མེད་རྣམ་སྤང་ཞིང་།
en: Should avoid others’ wives As if they were blazing flames

source: །རང་གི་ཆུང་མས་ཆོག་པར་གྱིས།
en: And be content with his own wife.

source: །གཞན་གྱི་བུད་མེད་མཐོང་ནས་ནི། །སྐྱེས་པ་གང་ཞིག་དེ་ལ་ཆགས།
en: “A man who, having seen others’ wives,

source: །དམྱལ་བའི་ཚོར་བས་ཉེན་པ་ཡི།
en: Feels desire for them

source: །སྡུག་བསྔལ་མང་པོ་མྱོང་བར་འགྱུར།
en: Will experience much suffering, Gripped by hellish pains.

source: །དེ་དག་གིས་དེ་ལྟར་སྡིག་བྱས་པས།
en: “Since I had thus committed a sin, I experienced its fruit, which was not insignificant,

source: །སྔོན་གྱི་ཚེ་རབས་གཞན་དུ་ན། །ཡུན་རིང་དམྱལ་བར་དེ་ཡི་ནི། །འབྲས་བུ་མི་ཉུང་ཉམས་སུ་མྱོང་།
en: In other past lives in hell For a very long time.

source: །བདག་གི་སྐྱེ་བ་ཐ་མ་འདིར།
en: “In this final birth,

source: །བླ་ན་མེད་པའི་གནས་ཐོབ་ནས།
en: Having attained the supreme state,

source: །སྡུག་བསྔལ་ཀུན་ལས་བདག་གྲོལ་ཞིང་། །བསིལ་བར་གྱུར་ཅིང་མྱ་ངན་འདས།
en: I was liberated from all suffering And became peaceful and emancipated.

source: །དེ་ལྟ་བས་ན་བདེ་འདོད་ཅིང་།
en: “Therefore, one who wishes for happiness

source: །སྡུག་བསྔལ་ཉིད་ནི་མི་འདོད་པས།
en: And does not wish for suffering

source: །གཞན་གྱི་བུད་མེད་འགྲོ་མི་བྱ།
en: Should not approach others’ wives.

source: །དེ་ལྟར་སྡུག་བསྔལ་མི་འགྱུར་རོ།
en: If he does not, he will not suffer.”

source: །དེ་ནས་གནས་བརྟན་གྲགས་པས་ནི།
en: Thus the Elder Yaśas Explained his karma,

source: །མ་དྲོས་པ་ཡི་མཚོ་ཆེན་དུ། །རང་གི་ལས་ནི་ལུང་བསྟན་ནོ།
en: On the great lake Anavatapta.

source: །གནས་བརྟན་གྲགས་པའི་ལེའུ་སྟེ་བཅུ་དྲུག་པའོ།། །།
en: Here ends the sixteenth section: The Section of Yaśas. 7. Jyotiṣka

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་མེ་སྐྱེས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Jyotiṣka, “O Venerable Jyotiṣka, the venerable Yaśas has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་མེ་སྐྱེས་ཚེ་དང་ལྡན་པ་གྲགས་པས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Jyotiṣka, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་མེ་སྐྱེས་ཀྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་མེ་སྐྱེས་ཀྱིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ། རྒྱལ་པོའི་ཕོ་བྲང་བཤེས་ལྡན་དུ།
en: Then the venerable Jyotiṣka did explain his karmic bond:

source: །རྣམ་པར་གཟིགས་ཀྱི་ཚངས་སྤྱོད་ཚེ།
en: “When Vipaśyin was leading the pure life

source: །ཉོན་མོངས་མེད་ཅེས་བྱ་བ་ཡི།
en: In the royal capital of Bandhumatī,

source: །ཚོང་དཔོན་ནོར་མང་ཞིག་ཏུ་གྱུར།
en: I was the wealthy head of a guild

source: །ཐུབ་ཆེན་རྣམ་པར་གཟིགས་པ་ཡི།
en: Named Anaṅgana.

source: །འཁོར་ནི་སྟོང་ཕྲག་བརྒྱ་དག་དང་། །དྲུག་བཅུ་རྩ་གཉིས་ཡོད་པར་གྱུར།
en: “There were six million Two hundred thousand attendants To the great Muni, Vipaśyin.

source: །དེ་ཚེ་རྒྱལ་པོ་བཤེས་ལྡན་དང་། །བདག་གིས་མི་ཡི་ཁྱུ་མཆོག་ནི།
en: “At that time, King Bandhumat And I invited the Bull among Men

source: །ཟླ་བ་གསུམ་དུ་སྤྱན་དྲངས་ནས།
en: For three months. Each of us satisfied him and his group of disciples

source: །ཕྱིར་ཞིང་བཤོས་ཐང་བསྐྱེད་པ་ཡིས།
en: With meals, each time better than the other’s.

source: །ཚོགས་དང་བཅས་ཏེ་ཚིམ་པར་བྱས།
en: “I provided the Buddha with meals

source: །བདག་གིས་སངས་རྒྱས་ཟླ་གསུམ་དུ།
en: For three months.

source: །བཤོས་གསོལ་དེ་ནས་བཤེས་ལྡན་གྱིས།
en: After that, Bandhumat,

source: །དེ་ཚེ་རྗེས་གཅོད་སྟོན་མོ་ནི།
en: For the final day,

source: །བཟའ་བཅའ་དང་ནི་ན་བཟའ་དང་། །གནས་མལ་དག་དང་ལྡན་པ་གསོལ།
en: Gave him a generous reception, Providing various kinds of food, and bedding and seats.

source: །དེ་ནས་སྐྱེད་མོས་ཚལ་བསྟར་པ། །རྒྱལ་པོ་དེས་ནི་ཕུལ་བར་གྱུར།
en: “Thereupon the king donated A cleanly swept park.

source: །དེ་བཞིན་དགེ་སློང་རེ་རེ་ལ།
en: Likewise, he gave Donations to each monk— “Ten thousand seats

source: །གོས་ཀྱིས་ཀུན་ནས་གཡོགས་པའི་སྟན།
en: Covered with cloth—and also at that time

source: །བརྒྱ་སྟོང་དག་དང་དེ་ཡི་ཚེ། །གསེར་གྱི་དྲ་བས་གཡོགས་པ་ཡི། །གླང་པོ་ཤིན་ཏུ་ལེགས་བརྒྱན་པ། །མི་ཉུང་བ་དག་སྦྱིན་པར་བཏང་།
en: Many well-decorated elephants Covered with golden nets.

source: །དགེ་སློང་རེ་རེའི་སྤྱི་བོར་ནི།
en: “At that time, also, above each monk

source: །དེ་ཚེ་གདུགས་ཀྱང་འཛིན་པར་བྱེད།
en: A parasol was raised.

source: །དེ་ནས་བུད་མེད་ལེགས་བརྒྱན་ལུས།
en: Well-decorated women, whose bodies

source: །ཙན་དན་ཨ་ག་རུས་བསྐུས་པ།
en: Were anointed with sandal paste and agaru, “Were made by him

source: །དེ་དག་དགེ་སློང་རེ་རེ་ལའང་།
en: To attend on each monk too.

source: །བསྙེན་བཀུར་དག་ནི་བྱེད་དུ་བཅུག །རྒྱལ་པོ་དེས་ནི་དེ་ལྟ་བུའི།
en: The king himself served the Buddha

source: །རྗེས་གཅོད་པ་ལ་བཀུར་སྟི་བྱས།
en: In such a reception on the final day. “The king satisfied

source: །དྲང་སྲོང་གཙོ་བོ་རྣམ་པར་འདྲེན།
en: The foremost ṛṣi, the Leader.

source: །རྒྱལ་པོས་ཚིམ་པར་བྱས་པ་དང་། །སྟན་དེ་ཕུན་སུམ་ཚོགས་མཐོང་ནས།
en: When I saw his perfect seat,

source: །དེ་ནས་བདག་གིས་བསམས་པ་ནི།
en: I thought at that time,

source: །བདག་ལ་བཟའ་དང་བཅའ་ཡོད་ཀྱང་།
en: “ ‘Although I have various kinds of food,

source: །འདི་འདྲ་བ་ཡི་སྟན་མེད་དེ།
en: I do not have such a seat. How might I obtain

source: །ཕུན་སུམ་ཚོགས་པ་དེ་འདྲ་དང་། །གླང་པོ་བདག་ལ་ག་ལ་བདོག །ལྷ་ཡི་དབང་པོ་དབང་སྒྱུར་བ།
en: Such wealth and elephants?’

source: །བརྒྱ་བྱིན་བདག་གི་དྲུང་དུ་འོངས།
en: “The Lord of Gods, the ruler Śakra, Appeared before me.

source: །དེ་ནས་བརྒྱ་བྱིན་བདག་ལ་སྨྲས།
en: Then Śakra said to me,

source: །ཁྱོད་ཀྱི་གྲོགས་པོ་ངས་བྱ་ཞེས།
en: ‘I, who am your friend, will make them.’

source: །དེས་ནི་ལྷ་ཡི་སྐྱེད་མོས་ཚལ། །མཛེས་ཤིང་ཡིད་དུ་འོང་བ་སྤྲུལ།
en: “He created a divine, Beautiful, comfortable park.

source: །ལྷ་ཡི་གདན་ནི་བཤམས་ནས་ནི།
en: He prepared a divine seat

source: །ལྷ་ཡི་གཡོགས་པ་རྣམས་ཀྱིས་གཡོགས།
en: And covered it with divine coverings.

source: །དེ་ནས་བདག་གིས་བཅོམ་ལྡན་འདས།
en: “After that, I invited the Blessed One Vipaśyin,

source: །རྣམ་གཟིགས་འཇིག་རྟེན་གྱིས་བཀུར་བ།
en: The best of people, who was worshiped By people all over the world,

source: །མི་མཆོག་དེ་ནི་ཉན་ཐོས་བཅས། །གདུགས་ཚོད་ལ་ནི་སྤྱན་དྲངས་ནས།
en: For a meal together with his disciples.

source: །ས་སྲུང་ལ་སོགས་གླང་པོ་རྣམས།
en: “I had elephants, including Airāvaṇa,

source: །ལྷ་ཡི་རྒྱན་གྱིས་ལེགས་བརྒྱན་པ། །དགེ་སློང་རེ་རེའི་སྤྱི་བོར་ནི། །དེ་ཚེ་གདུགས་དག་འཛིན་པར་བྱེད།
en: Decorated with divine accessories, And had parasols raised Above each monk.

source: །དེ་ནས་རྣམ་པར་འདྲེན་པ་ནི།
en: “Thereupon I offered

source: །ལྷ་ཡི་ཞལ་ཟས་རྣམས་ཀྱིས་བསྟབས།
en: A divine meal to the Leader.

source: །ཐུབ་པ་ཉན་ཐོས་ཐབས་ཅིག་ལ།
en: I also dressed the Muni and his disciples

source: །བདག་གིས་ལྷ་ཡི་གོས་ཀྱིས་གཡོགས།
en: In divine clothes.

source: །བསོད་ནམས་བྱས་པས་ལྷ་དང་ནི། །མི་ཡི་ནང་དུ་མཛེས་གྱུར་པས།
en: Having made merit, I was born among beautiful gods and humans. “I did not know any inferior state of existence

source: །བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་ཏུ། །ངན་འགྲོ་བདག་གིས་མི་ཤེས་སོ།
en: For ninety-one eons.

source: །རྣམ་པར་གཟིགས་པ་དཔལ་ལྡན་པོ།
en: Since I had venerated Vipaśyin, the glorious one,

source: །དྲང་སྲོང་ཆེན་པོས་བསྙེན་བཀུར་བས།
en: The great ṛṣi,

source: །བདག་གི་སྐྱེ་བ་ཐ་མ་འདི།
en: “This is my final life. I was born

source: །རྒྱལ་པོའི་ཁབ་ཏུ་བདག་སྐྱེས་སོ།
en: Into a fabulously wealthy family

source: །གཟུགས་ཅན་སྙིང་པོའི་གྲོང་ཁྱེར་དུ། །ནོར་ཆེན་ཕྱུག་པོའི་ཁྱིམ་དུ་ནི། །རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་ནི།
en: In Rājagṛha, Bimbisāra’s city.

source: །དེ་ཚེ་བདག་རྗེད་བཀུར་སྟི་བྱས།
en: “I was treated with honor

source: །བློན་པོ་རྣམས་དང་གྲོང་མི་ལ།
en: By King Bimbisāra

source: །ཀུན་ནས་སྡུག་ཅིང་ཡིད་དུ་འོང་།
en: And was entirely lovable and pleasing To the ministers and citizens.

source: །ལྷ་ཡི་འདོད་པས་རྟག་ཏུ་ནི། །སྲིད་པ་འདིར་ནི་བདག་ཚིམ་བྱས།
en: “I was always satisfied With divine objects of desire in this life.

source: །མིར་གྱུར་ན་ཡང་ལྷ་རྣམས་ཀྱི།
en: As a human, I enjoyed

source: །འདོད་པ་ཡིད་འོང་ཉམས་སུ་མྱོང་།
en: Pleasant objects of desire fit for gods.

source: །དེ་ནས་དེད་དཔོན་བླ་ན་མེད།
en: “Thereupon the best caravan leader,

source: །སངས་རྒྱས་རྣམ་པར་འདྲེན་པ་པོ།
en: The Buddha, the Guide,

source: །ཐུབ་པ་ཆེན་པོ་ཐུགས་བརྩེ་བས།
en: The great compassionate Muni,

source: །རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་པར་གྱུར།
en: Traveled to Rājagṛha.

source: །སངས་རྒྱས་ཤེས་རབ་ཆེན་པོ་ནི། །རྒྱལ་པོའི་ཁབ་བྱོན་བདག་གིས་ཐོས།
en: “When I heard that the Buddha, the one of great wisdom, Had arrived in Rājagṛha,

source: །བཅོམ་ལྡན་ཐུབ་དེ་གང་ན་བར།
en: I went to the Blessed One, the Muni,

source: །དགའ་བའི་ཡིད་ཀྱིས་སོང་བ་དང་། །འཇིག་རྟེན་གསལ་བ་འོད་མཛད་པ།
en: With my mind pleased. “Upon seeing the illuminator of the world, the maker of light,

source: །སྒྲོན་མ་འཛིན་པ་མཐོང་ནས་ནི།
en: Wielder of the lamp,

source: །དེ་ཚེ་བབས་ཏེ་རྐང་པས་ནི།
en: I alighted from the vehicle

source: །ཐུབ་པའི་སྤྱན་སྔར་སོང་ནས་ཀྱང་།
en: And went on foot before the Muni.

source: །ཐུབ་པ་ཆེ་ལ་བདག་མགུ་བས།
en: “Delighted with the great Muni,

source: །ཞབས་གཉིས་ལ་ནི་མགོས་ཕྱག་བྱས།
en: I bowed my head at his feet.

source: །སྐྱེས་མཆོག་ལ་ནི་ཕྱག་བྱས་ནས།
en: Having saluted the most excellent one,

source: །ཕྱོགས་གཅིག་ཏུ་ནི་འདུག་ནས་སུ།
en: I sat to one side. “I quickly pleased

source: །འགྲོ་བས་བསྙེན་བཀུར་བྱས་པ་ཡི།
en: The caravan leader, the sun of humans,

source: །དཔའ་ཆེན་བདུད་ཀྱི་འཆིང་བ་བཅད། །དེད་དཔོན་མི་ཡི་ཉི་མ་ནི།
en: Possessed of great power, who had cut Māra’s fetter,

source: །རིང་པོ་མ་ཐོགས་མཉེས་པར་བྱས།
en: Who was served by beings.

source: །འཇིག་རྟེན་སྟོན་པ་བླ་མེད་པ།
en: “The best teacher of the world,

source: །དེས་ནི་བདག་ལ་ཐུགས་བརྩེ་བས།
en: Out of compassion,

source: །འཕགས་པའི་བདེན་པ་རྣམས་བཤད་དེ།
en: Taught me the truths of the noble ones.

source: །དེ་ཚེ་བདག་གིས་སོ་སོར་རྟོགས།
en: I then understood them.

source: །དེ་ནས་བདག་གིས་ཐུགས་རྗེ་ཅན། །རྫོགས་སངས་རྒྱས་ལ་འདི་སྐད་གསོལ།
en: “Thereupon I said to the Completely Awakened One, The one of great mercy,

source: །དཔའ་བོ་བདག་ནི་རབ་འབྱུང་ཞིང་།
en: ‘O Hero, I wish to go forth

source: །བསྙེན་པར་རྫོགས་པར་ཐོབ་པར་འཚལ།
en: And be ordained.’

source: །དེ་ནས་ཤེས་རབ་དམ་པ་ཅན།
en: “Then the one who possessed the supreme wisdom,

source: །སངས་རྒྱས་གང་ཟག་ཟླ་མེད་པས།
en: The Buddha, the matchless man,

source: །དགེ་སློང་ཚུར་ཤོག་ཅེས་གསུངས་པས།
en: Said, ‘Come, monk,’

source: །བདག་ནི་བསྙེན་པར་རྫོགས་པར་གྱུར།
en: And I was ordained.

source: །དེས་ན་བདག་ནི་བག་ཡོད་ཅིང་།
en: “Thus, being careful,

source: །བརྩོན་འགྲུས་བསམ་གཏན་བརྟན་པོ་ཡིས།
en: Exerting myself, practicing steady meditation, I reached the most excellent state,

source: །བདུད་རྩི་མྱ་ངན་འདས་ཞི་བའི།
en: The nectar, tranquil nirvāṇa.

source: །གནས་ཀྱི་དམ་པ་རེག་པར་གྱུར།
en: “I have pleased this caravan leader,

source: །སྲིད་པར་འཁོར་བར་སྐྱེ་བ་དང་། །འཆི་བ་རྣམས་ལས་བདག་གྲོལ་ཅིང་།
en: “I was liberated from births and deaths In the transmigration of existence.

source: །མྱ་ངན་སྨྲེ་སྔགས་འདོན་པ་ལས།
en: Having dispelled sorrow and lamentation,

source: །ཐམས་ཅད་དུ་ནི་བདག་གྲོལ་ཏོ།
en: I was entirely liberated.”

source: །དེ་ལྟར་གནས་བརྟན་མེ་སྐྱེས་ཀྱིས།
en: Thus the Elder Jyotiṣka Explained his karma,

source: །མེ་སྐྱེས་ཀྱི་ལེའུ་སྟེ་བཅུ་བདུན་པའོ།། །།
en: Here ends the seventeenth section: The Section of Jyotiṣka. 8. Rāṣṭrapāla

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Rāṣṭrapāla, “O Venerable Rāṣṭrapāla, the venerable Jyotiṣka has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ཚེ་དང་ལྡན་པ་མེ་སྐྱེས་ཀྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Rāṣṭrapāla, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Rāṣṭrapāla did explain his karmic bond:

source: ཀ་ཤིའི་ཡུལ་འཁོར་དར་བྱེད་པ། །རྒྱལ་པོ་ཀྲྀ་ཀཱི་ཞེས་བྱ་བྱུང་།
en: “When there was a king named Kṛkin, Who brought prosperity to the country of Kāśi,

source: །རྒྱལ་པོ་ཀྲྀ་ཀཱིའི་བུ་ཐ་ཆུངས། །དེ་ཡི་ཚེ་ན་བདག་གྱུར་ཏོ།
en: At that time I was King Kṛkin’s youngest son. “He had a large stūpa built

source: །འོད་སྲུང་དཔལ་དང་ལྡན་པ་ཡི།
en: For Kāśyapa, the glorious one.

source: །མཆོད་རྟེན་ཆེན་པོ་བརྩིགས་པ་དང་། །ཕ་ཡི་ཡིད་ནི་བསྲུང་བའི་ཕྱིར།
en: Obeying my father’s wishes,

source: །དེ་ལ་གདུགས་བུ་ཆུང་ཞིག་ཕུལ།
en: I offered there a little parasol.

source: །དགའ་བའི་ཡིད་ཀྱིས་མཆོད་རྟེན་ལ།
en: “Through setting a parasol on the stūpa With my mind pleased,

source: །གདུགས་ནི་གདགས་པ་བྱས་པ་དེས།
en: I made a wish to go forth

source: །རབ་བྱུང་རྫོགས་པའི་སངས་རྒྱས་དང་། །ལྷན་ཅིག་འགྲོགས་གྱུར་སྨོན་ལམ་བཏབ།
en: And be in the company of the Completely Awakened One.

source: །བང་མཛོད་སྟུག་པོར་བདག་སྐྱེས་ཏེ།
en: I was born in Sthūlakoṣṭhaka.

source: །དེར་ཡང་ཚོང་དཔོན་ཁྱིམ་དུ་སྐྱེས།
en: In the house of the head of a guild there,

source: །རིགས་ཀྱི་བུ་གཅིག་པར་གྱུར་ཏེ།
en: And so became a son of a good family.

source: །མི་དབང་ཀཽ་རབ་བྱ་དང་ནི།
en: “Along with the master of the people Kauravya,

source: །དེ་བཞིན་ཀུན་སྡུག་ཡིད་དུ་འོང་།
en: I was lovable and pleasing to everyone. Likewise, I was pleasing

source: །དེ་བཞིན་ཡུལ་མི་རྣམས་དང་ནི། །བདག་ནི་གཉེན་ཚོགས་ཡིད་དུ་འོང་།
en: To provincial dwellers and my relatives.

source: །མཛེས་ཤིང་བལྟ་ན་སྡུག་པ་དང་། །གཟུགས་བཟང་ཤིན་ཏུ་དབྱིབས་ལེགས་ཤིང་། །མི་ཡི་འབྱོར་པ་རྣམས་ཀྱིས་ནི།
en: “Attractive, pleasant to behold, Well proportioned, endowed with a very handsome figure,

source: །འདོད་པ་ཐམས་ཅད་ཕུན་སུམ་ཚོགས།
en: I abundantly possessed every object of desire Made possible by human riches.

source: །སྟོན་པ་དགའ་ཞིང་ཡིད་འོང་བ།
en: “Then the lovable, pleasant Teacher

source: །བང་མཛོད་སྟུག་པོར་གཤེགས་པ་ནི།
en: Came to Sthūlakoṣṭhaka.

source: །བདག་གིས་མཐོང་ནས་སེམས་དད་པས།
en: When I saw him, with a pure mind

source: །རབ་ཏུ་འབྱུང་བར་གསོལ་བ་བཏབ།
en: I asked him for permission to go forth.

source: །སྟོན་པ་གང་ཟག་ཟླ་མེད་དེ།
en: “The Teacher, the matchless man,

source: །བསམ་པ་ཀུན་ལ་མཁས་གྱུར་པས།
en: Who knew every thought of others,

source: །བདག་གི་བསམ་པ་དེས་མཁྱེན་ནས།
en: Knew my thoughts, though,

source: །རབ་ཏུ་བྱུང་བ་ལས་བཟློག་པ།
en: And refused to let me go forth:

source: །ཕ་མ་དག་གིས་མ་གནང་བའི།
en: “ ‘Without parental permission,

source: །གང་ཟག་དགེ་ཡང་སངས་རྒྱས་རྣམས།
en: The buddhas do not let a man go forth,

source: །རབ་ཏུ་འབྱིན་པར་མི་མཛད་ཀྱིས།
en: Even if he is good.

source: །སོང་ལ་བདག་ཉིད་ཐར་བར་གྱིས།
en: Go and secure your release.’

source: །དེ་ནས་ཁྱིམ་དུ་བདག་སོང་ནས།
en: “Then I went home

source: །ཕ་མ་གཉིས་ལ་སྨྲས་པ་ནི།
en: And requested my two parents, ‘Dear ones, please allow me

source: །ཡབ་གཅིག་གནང་བར་མཛོད་ཅིག་བདག །ཁྱིམ་མ་མཆིས་པར་རབ་འབྱུང་ངོ་།
en: To go forth into homelessness.’

source: །ཕ་མས་བདག་ལས་ཐོས་ནས་ནི།
en: “When my parents heard this from me,

source: །དེ་ཚེ་ཡིད་མི་བདེར་གྱུར་ནས།
en: It caused them great grief:

source: །བུ་གཅིག་ཁྱོད་ནི་བདག་ཅག་གཉིས། །ཤི་བར་གྱུར་ནའང་མི་གནང་ངོ་།
en: ‘Our only son, neither of us Will allow you to do this, even if we die.’

source: །དེ་ཐོས་ནས་ནི་བདག་གིས་སུ།
en: “When I heard this, I lay on the ground, saying,

source: །གལ་ཏེ་མི་གནང་འདི་ཉིད་དུ།
en: ‘If you do not allow it,

source: །ཟས་མི་འཚལ་བར་བདག་འགུམ་ཞེས། །ས་ལ་ཡང་ནི་ཉལ་བ་བྱས།
en: I will not eat any food, and will die right here.’

source: །དེ་ཚེ་དཀར་པོའི་ཆོས་དག་གིས།
en: “Then, prompted by the white dharmas,

source: །བསྐུལ་ནས་རབ་འབྱུང་དོན་གཉེར་ཞིང་།
en: Desiring to go forth,

source: །ཐར་པར་འདོད་པས་ཞག་དྲུག་ཏུ།
en: Wishing for freedom, for six days

source: །ཟན་མ་ཟོས་པར་འདུག་པ་དང་། །དེ་ནས་བདག་དང་མཛའ་བ་ཡི།
en: I abstained from eating food. “Then my friends, who were the same age as I,

source: །ནེའུ་ཟླས་ཕ་མ་ལ་སྨྲས་པ།
en: Said to my parents,

source: །འདི་ནི་གནང་བར་གྱུར་ན་ལེགས།
en: ‘If you allow him, it will be fine.
